In [2]:
import pandas as pd
import numpy as np


s = pd.Series([1,2,3,4],index=["a","b","c","d"])

s

a    1
b    2
c    3
d    4
dtype: int64

In [4]:
# select using []

s["a"]

1

In [5]:
# reindex method  to rearrange the data 

s2 = s.reindex(["b","a","d","c"])


s2

b    2
a    1
d    4
c    3
dtype: int64

In [6]:
s3 = pd.Series(["blue","green","purple"],index=[0,2,5])

s3

0      blue
2     green
5    purple
dtype: object

In [8]:
# fill the empty value in s3 , use ffill method

s3.reindex(range(7),method="ffill")

s3

0      blue
2     green
5    purple
dtype: object

In [10]:
df = pd.DataFrame(np.arange(9).reshape(3,3),
                  index=["a","b","c"],
                  columns=["Python","Java","R"])

df

   Python  Java  R
a       0     1  2
b       3     4  5
c       6     7  8

In [11]:
# relocate rows 

df2 = df.reindex(['d','c','a','b'])

df2

   Python  Java    R
d     NaN   NaN  NaN
c     6.0   7.0  8.0
a     0.0   1.0  2.0
b     3.0   4.0  5.0

In [12]:
# drop method

s = pd.Series(np.arange(5.),index=["a","b","c","d","e"])

s

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [13]:
new_s = s.drop("c")

new_s

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [17]:
# delete more than one row 

new_s=s.drop(["d","e"])

new_s

a    0.0
b    1.0
c    2.0
dtype: float64

In [22]:
data = pd.DataFrame(np.arange(16).reshape(4,4), index=["Kate","John","Tim","Tom"],columns=list("ABCD"))

data

       A   B   C   D
Kate   0   1   2   3
John   4   5   6   7
Tim    8   9  10  11
Tom   12  13  14  15

In [23]:
mylist = list("ABCD")

mylist

['A', 'B', 'C', 'D']

In [25]:
data.drop(["Kate","Tim"])

       A   B   C   D
John   4   5   6   7
Tom   12  13  14  15

In [26]:
# delete particular column then axis paramter should be 1 

data.drop("A",axis=1)

       B   C   D
Kate   1   2   3
John   5   6   7
Tim    9  10  11
Tom   13  14  15

In [29]:
# delete particular row then axis paramter should be 0 

data.drop("John",axis=0)

       A   B   C   D
Kate   0   1   2   3
Tim    8   9  10  11
Tom   12  13  14  15

In [30]:
# mean method , the columns

data.mean(axis="index")

A    6.0
B    7.0
C    8.0
D    9.0
dtype: float64

In [31]:
# mean of rows

data.mean(axis="columns")

Kate     1.5
John     5.5
Tim      9.5
Tom     13.5
dtype: float64